opendj3-server-dev/tests/staf-tests/functional-tests/shared/data/dsml/suites/06delmoddelsuite/data/del057.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 1574
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
     <modifyRequest dn="uid=tmason, ou=People, o=dsmlfe.com">
          <modification name="labeleduri" operation="delete">
               <value>This is a MoDiFiEd ExamPle laBeledURI</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=bhall, ou=People, o=dsmlfe.com">
          <modification name="labeleduri" operation="delete">
               <value>This is a MoDiFiEd ExamPle laBeledURI</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=btalbot, ou=People, o=dsmlfe.com">
          <modification name="labeleduri" operation="delete">
               <value>This is a MoDiFiEd ExamPle laBeledURI</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=mward, ou=People, o=dsmlfe.com">
          <modification name="labeleduri" operation="delete">
               <value>This is a MoDiFiEd ExamPle laBeledURI</value>
          </modification>
     </modifyRequest>
     <modifyRequest dn="uid=bjablons, ou=People, o=dsmlfe.com">
          <modification name="labeleduri" operation="delete">
               <value>This is a MoDiFiEd ExamPle laBeledURI</value>
          </modification>
     </modifyRequest>
  </batchRequest>
  </soap-env:Body>
  </soap-env:Envelope>
